<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1b
# *Data Cleaning with Pandas*

In this lab we work with a file that has messy column names and a combination of missing and invalid data to be cleaned.

To start with load `rock.csv` into a dataframe.

In [29]:
import numpy as np
import pandas as pd

In [30]:
# ANSWER
df = pd.read_csv('C:/Users/Vinitha/Desktop/IOD/DATA/rock.csv')
print(df.columns)

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

### Check Column Names

Check column names and clean by converting all names to lowercase, replacing spaces with underscores (`_`) and removing question marks or asterisk (`*`) characters.

In [31]:
df.head()

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

In [32]:
df.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

In [33]:
# ANSWER
def clean_column(df):
    df.columns = df.columns.str.replace('?', '') \
                        .str.replace('*', '')\
                        .str.replace(' ', '_')\
                        .str.replace('_clean', '')\
                        .str.lower()
    return df
df= clean_column(df)
print(df.columns)

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'playcount', 'fg'],
      dtype='object')

In [34]:
df.columns

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'playcount', 'fg'],
      dtype='object')

### Replace Null Values With 0

Check 'release_year' column whether this column has any null values or not. Replace null values with 0.

In [35]:
df.isnull().sum()

song_clean        0
artist_clean      0
release_year    577
combined          0
first             0
year              0
playcount         0
fg                0
dtype: int64

In [36]:
print(df["release_year"].isnull().sum())

577

In [37]:
df["release_year"] = df["release_year"].fillna(0)

In [38]:
print(df["release_year"].isnull().sum())

0

In [39]:
# ANSWER
df["release_year"] = df["release_year"].fillna(0)
print(df["release_year"].isnull().sum())

0

## Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [40]:
song_facts_mask = df['release_year'] == 'SONGFACTS.COM'
df.loc[song_facts_mask, 'release_year'] = np.NaN

In [41]:
# ANSWER
df['release_year'] = pd.to_numeric(df['release_year'])
df.dtypes

song_clean       object
artist_clean     object
release_year    float64
combined         object
first             int64
year              int64
playcount         int64
fg                int64
dtype: object

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [42]:
print(df.describe().T[['min', 'max']])

              min     max
release_year  0.0  2014.0
first         1.0     1.0
year          0.0     1.0
playcount     0.0   142.0
fg            0.0   142.0

In [43]:
# ANSWER
print("min","\n",df.min(numeric_only = True),'\n',"max","\n",df.max(numeric_only = True))

min
 release_year    0.0
first           1.0
year            0.0
playcount       0.0
fg              0.0
dtype: float64
 max
 release_year    2014.0
first              1.0
year               1.0
playcount        142.0
fg               142.0
dtype: float64

## Write Some Functions

### Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [66]:
# ANSWER
#before_1970 = release_year < 1970
def check_song(row):
    print('Song: ', row['song_clean'])
    print('Artist: ', row['artist_clean'])
    print('Released before 1970: ', row['release_year'] < 1970)
    print('\n')

df.iloc[2]

song_clean                     Hold On Loosely
artist_clean                       .38 Special
release_year                            1981.0
combined        Hold On Loosely by .38 Special
first                                        1
year                                         1
playcount                                   85
fg                                          85
Name: 2, dtype: object

### Write a function that converts a column in a DataFrame to a numeric type and otherwise replaces entries with np.nan

In [67]:
# ANSWER
def covert(columns):
    df['release_year'] = pd.to_numeric(df['release_year'])
    return column
df.dtypes

song_clean       object
artist_clean     object
release_year    float64
combined         object
first             int64
year              int64
playcount         int64
fg                int64
dtype: object

In [73]:
def convert_to_numeric(column):
    column = pd.to_numeric(column, errors='coerce')
    return column

In [74]:
df["combined"]

0                         Caught Up in You by .38 Special
1                             Fantasy Girl by .38 Special
2                          Hold On Loosely by .38 Special
3                   Rockin' Into the Night by .38 Special
4                               Art For Arts Sake by 10cc
                              ...
2225                    She Loves My Automobile by ZZ Top
2226                          Tube Snake Boogie by ZZ Top
2227                                       Tush by ZZ Top
2228                                 TV Dinners by ZZ Top
2229    WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...
Name: combined, Length: 2230, dtype: object

### Apply this last function to your dataset

In [76]:
# ANSWER
df[['release_year', 'first', 'year', 'playcount', 'fg']].apply(convert_to_numeric)

      release_year  first  year  playcount   fg
0           1982.0      1     1         82   82
1              0.0      1     0          3    0
2           1981.0      1     1         85   85
3           1980.0      1     1         18   18
4           1975.0      1     1          1    1
...            ...    ...   ...        ...  ...
2225           0.0      1     0          1    0
2226        1981.0      1     1         32   32
2227        1975.0      1     1        109  109
2228        1983.0      1     1          1    1
2229        1973.0      1     1          2    2

[2230 rows x 5 columns]

### 'Describe' the new DataFrame

In [78]:
# ANSWER
df.describe().T

,count,mean,std,min,25%,50%,75%,max
release_year,2229.0,1465.988784,866.834789,0.0,0.0,1973.0,1981.0,2014.0
first,2230.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
year,2230.0,0.741256,0.438043,0.0,0.0,1.0,1.0,1.0
playcount,2230.0,16.872646,25.302972,0.0,1.0,4.0,21.0,142.0
fg,2230.0,15.048430,25.288366,0.0,0.0,3.0,18.0,142.0

>



---



---



> > > > > > > > > © 2024 Institute of Data


---



---